Revit 2024 API
BaseImportOptions.SetLayerSelection Method
 Set the layers name which user want to import into Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetLayerSelection(
	ICollection<string> layerSelection
)
Visual Basic
Public Sub SetLayerSelection ( _
	layerSelection As ICollection(Of String) _
)
Visual C++
public:
void SetLayerSelection(
	ICollection<String^>^ layerSelection
)
Parameters
layerSelection
Type: System.Collections.Generic.ICollection<String>
 The layers imported into Revit.
Remarks
 If user don't set any layer selection, all layers would be imported into Revit for dgn. But for dwg|dxf, all layers (or visible layers, it is up to visibleLayersOnly was set or not) would be imported into Revit.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace